; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob1) (:domain depot)
(:objects
	depot0 depot1 depot2 - depot
	distributor0 distributor1 distributor2 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 pallet11 pallet12 pallet13 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 - crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 hoist10 hoist11 hoist12 hoist13 - hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 distributor0)
	(clear crate8)
	(at pallet4 distributor1)
	(clear crate0)
	(at pallet5 distributor2)
	(clear pallet5)
	(at pallet6 depot1)
	(clear pallet6)
	(at pallet7 distributor1)
	(clear pallet7)
	(at pallet8 distributor0)
	(clear crate3)
	(at pallet9 depot2)
	(clear crate2)
	(at pallet10 distributor1)
	(clear pallet10)
	(at pallet11 depot0)
	(clear crate6)
	(at pallet12 depot2)
	(clear crate7)
	(at pallet13 distributor2)
	(clear pallet13)
	(at truck0 depot2)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 491)
	(at truck1 distributor1)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 306)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 distributor2)
	(available hoist6)
	(at hoist7 depot0)
	(available hoist7)
	(at hoist8 depot2)
	(available hoist8)
	(at hoist9 depot1)
	(available hoist9)
	(at hoist10 distributor2)
	(available hoist10)
	(at hoist11 depot1)
	(available hoist11)
	(at hoist12 depot2)
	(available hoist12)
	(at hoist13 distributor0)
	(available hoist13)
	(at crate0 distributor1)
	(on crate0 pallet4)
	(= (weight crate0) 83)
	(at crate1 depot2)
	(on crate1 pallet12)
	(= (weight crate1) 23)
	(at crate2 depot2)
	(on crate2 pallet9)
	(= (weight crate2) 36)
	(at crate3 distributor0)
	(on crate3 pallet8)
	(= (weight crate3) 96)
	(at crate4 depot2)
	(on crate4 crate1)
	(= (weight crate4) 66)
	(at crate5 depot2)
	(on crate5 crate4)
	(= (weight crate5) 44)
	(at crate6 depot0)
	(on crate6 pallet11)
	(= (weight crate6) 40)
	(at crate7 depot2)
	(on crate7 crate5)
	(= (weight crate7) 69)
	(at crate8 distributor0)
	(on crate8 pallet3)
	(= (weight crate8) 49)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 pallet1)
		(on crate1 crate8)
		(on crate2 pallet11)
		(on crate3 pallet2)
		(on crate4 pallet3)
		(on crate5 pallet6)
		(on crate6 pallet13)
		(on crate8 pallet12)
	)
)

(:metric minimize (total-time)))

; plan
1. (lift hoist12 crate7 crate5 depot2)
   deleted: (at crate7 depot2) (clear crate7) (available hoist12) (on crate7 crate5)
   added: (lifting hoist12 crate7) (clear crate5)
   changed: (fuel-cost) from 0 to 1
   goals met: 0 of 8
2. (lift hoist4 crate0 pallet4 distributor1)
   deleted: (at crate0 distributor1) (clear crate0) (available hoist4) (on crate0 pallet4)
   added: (lifting hoist4 crate0) (clear pallet4)
   changed: (fuel-cost) from 1 to 2
   goals met: 0 of 8
3. (lift hoist8 crate5 crate4 depot2)
   deleted: (at crate5 depot2) (clear crate5) (available hoist8) (on crate5 crate4)
   added: (lifting hoist8 crate5) (clear crate4)
   changed: (fuel-cost) from 2 to 3
   goals met: 0 of 8
4. (load hoist4 crate0 truck1 distributor1)
   deleted: (lifting hoist4 crate0)
   added: (in crate0 truck1) (available hoist4)
   changed: (current_load truck1) from 0 to 83
   goals met: 0 of 8
5. (drive truck1 distributor1 depot1)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot1)
   changed: (fuel-cost) from 3 to 13
   goals met: 0 of 8
6. (load hoist8 crate5 truck0 depot2)
   deleted: (lifting hoist8 crate5)
   added: (in crate5 truck0) (available hoist8)
   changed: (current_load truck0) from 0 to 44
   goals met: 0 of 8
7. (unload hoist1 crate0 truck1 depot1)
   deleted: (in crate0 truck1) (available hoist1)
   added: (lifting hoist1 crate0)
   changed: (current_load truck1) from 83 to 0
   goals met: 0 of 8
8. (drop hoist1 crate0 pallet1 depot1)
   deleted: (lifting hoist1 crate0) (clear pallet1)
   added: (available hoist1) (at crate0 depot1) (clear crate0) (on crate0 pallet1)
   goals met: 1 of 8
9. (lift hoist7 crate6 pallet11 depot0)
   deleted: (at crate6 depot0) (clear crate6) (available hoist7) (on crate6 pallet11)
   added: (lifting hoist7 crate6) (clear pallet11)
   changed: (fuel-cost) from 13 to 14
   goals met: 1 of 8
10. (lift hoist2 crate2 pallet9 depot2)
   deleted: (at crate2 depot2) (clear crate2) (available hoist2) (on crate2 pallet9)
   added: (lifting hoist2 crate2) (clear pallet9)
   changed: (fuel-cost) from 14 to 15
   goals met: 1 of 8
11. (load hoist2 crate2 truck0 depot2)
   deleted: (lifting hoist2 crate2)
   added: (in crate2 truck0) (available hoist2)
   changed: (current_load truck0) from 44 to 80
   goals met: 1 of 8
12. (lift hoist3 crate8 pallet3 distributor0)
   deleted: (at crate8 distributor0) (clear crate8) (available hoist3) (on crate8 pallet3)
   added: (lifting hoist3 crate8) (clear pallet3)
   changed: (fuel-cost) from 15 to 16
   goals met: 1 of 8
13. (lift hoist13 crate3 pallet8 distributor0)
   deleted: (at crate3 distributor0) (clear crate3) (available hoist13) (on crate3 pallet8)
   added: (lifting hoist13 crate3) (clear pallet8)
   changed: (fuel-cost) from 16 to 17
   goals met: 1 of 8
14. (drive truck0 depot2 depot0)
   deleted: (at truck0 depot2)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 17 to 27
   goals met: 1 of 8
15. (load hoist7 crate6 truck0 depot0)
   deleted: (lifting hoist7 crate6)
   added: (in crate6 truck0) (available hoist7)
   changed: (current_load truck0) from 80 to 120
   goals met: 1 of 8
16. (unload hoist0 crate2 truck0 depot0)
   deleted: (in crate2 truck0) (available hoist0)
   added: (lifting hoist0 crate2)
   changed: (current_load truck0) from 120 to 84
   goals met: 1 of 8
17. (drive truck0 depot0 depot1)
   deleted: (at truck0 depot0)
   added: (at truck0 depot1)
   changed: (fuel-cost) from 27 to 37
   goals met: 1 of 8
18. (unload hoist1 crate5 truck0 depot1)
   deleted: (in crate5 truck0) (available hoist1)
   added: (lifting hoist1 crate5)
   changed: (current_load truck0) from 84 to 40
   goals met: 1 of 8
19. (drive truck0 depot1 distributor2)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor2)
   changed: (fuel-cost) from 37 to 47
   goals met: 1 of 8
20. (unload hoist5 crate6 truck0 distributor2)
   deleted: (in crate6 truck0) (available hoist5)
   added: (lifting hoist5 crate6)
   changed: (current_load truck0) from 40 to 0
   goals met: 1 of 8
21. (drive truck0 distributor2 distributor0)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 47 to 57
   goals met: 1 of 8
22. (load hoist13 crate3 truck0 distributor0)
   deleted: (lifting hoist13 crate3)
   added: (in crate3 truck0) (available hoist13)
   changed: (current_load truck0) from 0 to 96
   goals met: 1 of 8
23. (drop hoist0 crate2 pallet11 depot0)
   deleted: (lifting hoist0 crate2) (clear pallet11)
   added: (available hoist0) (at crate2 depot0) (clear crate2) (on crate2 pallet11)
   goals met: 2 of 8
24. (drop hoist1 crate5 pallet6 depot1)
   deleted: (lifting hoist1 crate5) (clear pallet6)
   added: (available hoist1) (at crate5 depot1) (clear crate5) (on crate5 pallet6)
   goals met: 3 of 8
25. (drop hoist5 crate6 pallet13 distributor2)
   deleted: (lifting hoist5 crate6) (clear pallet13)
   added: (available hoist5) (at crate6 distributor2) (clear crate6) (on crate6 pallet13)
   goals met: 4 of 8
26. (lift hoist2 crate4 crate1 depot2)
   deleted: (at crate4 depot2) (clear crate4) (available hoist2) (on crate4 crate1)
   added: (lifting hoist2 crate4) (clear crate1)
   changed: (fuel-cost) from 57 to 58
   goals met: 4 of 8
27. (lift hoist8 crate1 pallet12 depot2)
   deleted: (at crate1 depot2) (clear crate1) (available hoist8) (on crate1 pallet12)
   added: (lifting hoist8 crate1) (clear pallet12)
   changed: (fuel-cost) from 58 to 59
   goals met: 4 of 8
28. (load hoist3 crate8 truck0 distributor0)
   deleted: (lifting hoist3 crate8)
   added: (in crate8 truck0) (available hoist3)
   changed: (current_load truck0) from 96 to 145
   goals met: 4 of 8
29. (drive truck0 distributor0 depot2)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot2)
   changed: (fuel-cost) from 59 to 69
   goals met: 4 of 8
30. (load hoist2 crate4 truck0 depot2)
   deleted: (lifting hoist2 crate4)
   added: (in crate4 truck0) (available hoist2)
   changed: (current_load truck0) from 145 to 211
   goals met: 4 of 8
31. (unload hoist2 crate3 truck0 depot2)
   deleted: (in crate3 truck0) (available hoist2)
   added: (lifting hoist2 crate3)
   changed: (current_load truck0) from 211 to 115
   goals met: 4 of 8
32. (drop hoist2 crate3 pallet2 depot2)
   deleted: (lifting hoist2 crate3) (clear pallet2)
   added: (available hoist2) (at crate3 depot2) (clear crate3) (on crate3 pallet2)
   goals met: 5 of 8
33. (unload hoist2 crate8 truck0 depot2)
   deleted: (in crate8 truck0) (available hoist2)
   added: (lifting hoist2 crate8)
   changed: (current_load truck0) from 115 to 66
   goals met: 5 of 8
34. (drive truck0 depot2 distributor0)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 69 to 79
   goals met: 5 of 8
35. (drop hoist2 crate8 pallet12 depot2)
   deleted: (lifting hoist2 crate8) (clear pallet12)
   added: (available hoist2) (at crate8 depot2) (clear crate8) (on crate8 pallet12)
   goals met: 6 of 8
36. (unload hoist3 crate4 truck0 distributor0)
   deleted: (in crate4 truck0) (available hoist3)
   added: (lifting hoist3 crate4)
   changed: (current_load truck0) from 66 to 0
   goals met: 6 of 8
37. (drop hoist8 crate1 crate8 depot2)
   deleted: (lifting hoist8 crate1) (clear crate8)
   added: (available hoist8) (at crate1 depot2) (clear crate1) (on crate1 crate8)
   goals met: 7 of 8
38. (drop hoist3 crate4 pallet3 distributor0)
   deleted: (lifting hoist3 crate4) (clear pallet3)
   added: (available hoist3) (at crate4 distributor0) (clear crate4) (on crate4 pallet3)
   goals met: 8 of 8
